//count word

let data = ['Засгийн', 'газарт', '6.4', 'сая', 'тонн', 'Нүүрс', 'алдагдсан', 'гэх', 'мэдээлэл', 'ирээгүй', 'байна.', 'Бодит', 'байдалд', 'ийм', 'их', 'хэмжээний', 'нүүрс', 'алдагдсан', 'гэх', 'асуудал', 'эргэлзээтэй', 'байна.', 'Хууль', 'хяналтын', 'байгууллага', 'хяналт', 'шалгалтын', 'ажил', 'явуулж', 'байна'];

console.log("Array дотор гараас орсон үг хэдэн ширхэг орсныг тоолдог алгоритм бичнэ үү. Шаардлага: том жижиг үсэг ялгахгүй тоолдог байх");
console.log(data);
let x = 0;
let searchWord = "нүүрс" ;
for(let i = 0; i < data.length; i++){
    if(data[i].toLowerCase() === searchWord.toLowerCase()){
        x++;
    }
}

console.log(searchWord + " gesen ug " + x + " udaa orson bna");